Revit 2027 API
NumberingSchema Methods
The NumberingSchema type exposes the following members.
Methods
Name | Description
AddMatchingParameter |  Add a new parameter to the matching criteria for this numbering schema.
AddPartitioningParameter |  Add a parameter to be used for partitioning elements in this schema.
AppendSequence | Obsolete.
 Appends all elements of one numbering sequence to the end of another sequence.
ApplyExternalSorting |  Applies an externally defined sort order to elements in a partition by assigning specific numbers.
ArePhasesModifiable |  Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
(Inherited from Element)
AssignElementsToSequence | Obsolete.
 Assigns the input elements to a sequence identified by the given partition name.
CanBeHidden | Indicates if the element can be hidden in the view.
(Inherited from Element)
CanBeLocked |  Identifies if the element can be locked.
(Inherited from Element)
CanChangePartitioningValue |  Returns true if this schema has partitions based on one parameter, that parameter is of type Text and it is modifiable.
CanDeleteSubelement |  Checks if given subelement can be removed from the element.
(Inherited from Element)
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
(Inherited from Element)
ChangeNumber |  Replaces an existing number with a another one that does not exists in the same partition.
ChangePartitioningValue |  Moves all elements of a numbering sequence from one partition to another.
ChangeTypeId(ElementId) |  Changes the type of the element.
(Inherited from Element)
Create |  Creates a numbering schema and registers it with a document.
DeleteEntity |  Deletes the existing entity created by %schema% in the element
(Inherited from Element)
DeleteSubelement |  Removes a subelement from the element.
(Inherited from Element)
DeleteSubelements |  Removes the subelements from the element.
(Inherited from Element)
Dispose
(Inherited from Element)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EvaluateAllParameterValues |  Evaluates all the parameters' values of the element.
(Inherited from Element)
EvaluateParameterValues |  Evaluate the parameters' values of the element on the given parameter ID set.
(Inherited from Element)
FilterCompatibleOutputParameters |  Returns the subset of input parameters that are valid as numbering output parameters for the specified categories or filter.
FilterToNumberableCategories |  Filters a set of categorie IDs to only does that are usable in numbering.
GetAvailableParameters |  Get all the available parameters that can be used with numbering.
GetCategoriesWitheBuiltInMatching |  Returns a set of all the categories ids that support built-in matching.
GetDependentElements |  Get all elements that, from a logical point of view, are the children of this Element.
(Inherited from Element)
GetEntity |  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
(Inherited from Element)
GetEntitySchemaGuids |  Returns the Schema guids of any Entities stored in this element.
(Inherited from Element)
GetExternalFileReference |  Gets information pertaining to the external file referenced by the element.
(Inherited from Element)
GetExternalResourceReference |  Gets the ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferenceExpanded |  Gets the collection of ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferences |  Gets the map of the external resource references referenced by the element.
(Inherited from Element)
GetExternalResourceReferencesExpanded |  Gets the expanded map of the external resource references referenced by the element.
(Inherited from Element)
GetFormatting |  Get the configuration for formatting.
GetGeneratingElementIds |  Returns the ids of the element(s) that generated the input geometry object.
(Inherited from Element)
GetGeometryObjectFromReference |  Retrieve one geometric primitive contained in the element given a reference.
(Inherited from Element)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetMatchingParameters |  Returns the parameters used for matching elements in this schema.
GetMaterialArea |  Gets the area of the material with the given id.
(Inherited from Element)
GetMaterialIds |  Gets the element ids of all materials present in the element.
(Inherited from Element)
GetMaterialVolume |  Gets the volume of the material with the given id.
(Inherited from Element)
GetMinimumNumberOfDigits | Obsolete.
 Returns the minimum number of digits to be used for formating the Number parameter of all enumerable elements of the given document.
GetMonitoredLinkElementIds |  Provides the link instance IDs when the element is monitoring.
(Inherited from Element)
GetMonitoredLocalElementIds |  Provides the local element IDs when the element is monitoring.
(Inherited from Element)
GetNumberingInfoForReferences |  Get all the ElementInfos from a given document related to a set of references.
GetNumberingSchema(Document, NumberingSchemaType) | Obsolete.
 Returns an instance of the specified Numbering Schema in the given document.
GetNumberingSchema(Document, String) |  Returns an instance of the specified Numbering Schema in the given document.
GetNumberingSequences |  Returns all numbering sequences within this numbering schema.
GetNumberingSequencesInfos |  Returns all numbering sequences infos within this numbering schema.
GetNumberOfPartitions |  Get the number of partitions managed by the schema.
GetNumbers |  Returns all numbers currently used in the given numbering sequence
GetOrderedParameters |  Gets the parameters associated to the element in order.
(Inherited from Element)
GetParameter | Retrieves a parameter from the element given identifier.
(Inherited from Element)
GetParameterFormatOptions |  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
(Inherited from Element)
GetParameters | Retrieves the parameters from the element via the given name.
(Inherited from Element)
GetPartitioningParameters |  Get the set of parameters used by this numbering schema to segregate a set of elements to a separate set of element where matching and numbering will be performed.
GetPhaseStatus |  Gets the status of a given element in the input phase
(Inherited from Element)
GetSchemasInDocument |  Returns a set of Ids of all Numbering Schema elements for a given document.
GetScopeDefiningCategories |  Get the categories that define the scope of this numbering schema.
GetSubelements |  Returns the collection of element subelements.
(Inherited from Element)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetTypeId |  Returns the identifier of this element's type.
(Inherited from Element)
GetUseBuiltInMatchingForCategories |  Get the set of categories where the built-in matching criteria is used.
GetValidCategoriesForNumbering |  Gets a list of categories that can be used for a numbering.
GetValidTypes() |  Obtains a set of types that are valid for this element.
(Inherited from Element)
HasPhases |  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
(Inherited from Element)
IsCreatedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsDemolishedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsExternalFileReference |  Determines whether this Element represents an external file.
(Inherited from Element)
IsHidden | Identifies if the element has been permanently hidden in the view.
(Inherited from Element)
IsMonitoringLinkElement |  Indicate whether an element is monitoring any elements in any linked models.
(Inherited from Element)
IsMonitoringLocalElement |  Indicate whether an element is monitoring other local elements.
(Inherited from Element)
IsPhaseCreatedValid |  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
(Inherited from Element)
IsPhaseDemolishedValid |  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
(Inherited from Element)
IsValidPartitionName |  Tests if the given string can be used as a name for a numbering partition.
IsValidType(ElementId) |  Checks if given type is valid for this element.
(Inherited from Element)
LookupParameter | Attempts to find a parameter on the element which has the given name.
(Inherited from Element)
MergeSequences | Obsolete.
 Merges all elements from given numbering sequences to a new sequence.
MoveSequence | Obsolete.
 Moves all elements of a numbering sequence from one partition to another.
RefersToExternalResourceReference |  Determines whether this Element uses external resources associated with a specified external resource type.
(Inherited from Element)
RefersToExternalResourceReferences |  Determines whether this Element uses external resources.
(Inherited from Element)
RemoveGaps |  Removes gaps, if any, in a numbering sequence
RemoveMatchingParameter |  Remove a parameter from the set of parameters used in matching elements so they would get the same number.
RemovePartitioningParameter |  Remove a parameter that is used for partitioning elements in this schema.
SetEntity |  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
(Inherited from Element)
SetFormatting |  Set the NumberingFormatSettings for this schema.
SetMatchingParameters |  Sets the parameters used by a specific numbering schema for matching elements so they would get the same number.
SetMinimumNumberOfDigits | Obsolete.
 Sets a new value for the minimum number of digits to be used for formating the Number parameter of all numbered elements of the given document.
SetPartitioningParameters |  Set the set of parameters used by this numbering schema to segregate a set of elements to a separate set of element where matching and numbering will be performed.
SetScopeDefiningFilterAndOutputParam |  Sets the filter and the output parameter that is going to be used by this schema.
SetUseBuiltInMatchingForCategories |  Use the built-in matching criteria for a set of categories if one is available for a given category.
ShiftNumbers |  Shifts all numbers in the sequence so the starting number has the given value.
SwapNumber |  Replaces an existing number with a another one that exists in the same partition.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace